
&НаСервере
Процедура РассчитатьНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Рассчитать();
	ЗначениеВДанныеФормы(ДокументОбъект,Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	       
	Если Объект.Ссылка.Пустая() или Модифицированность Тогда
		Ответ = Вопрос("Перед расчетом документ будет записан. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Записать();
	КонецЕсли;
	
	РассчитатьНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры
