// @strict-types


Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	ИмяТекущегоПользователя = ИмяПользователя();
	ТекущийСотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ИмяТекущегоПользователя, Истина);
	Если Не ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		НовыйСотрудник = Справочники.Сотрудники.СоздатьЭлемент();
		НовыйСотрудник.Код = ИмяТекущегоПользователя;
		НовыйСотрудник.Наименование = ИмяТекущегоПользователя;
		НовыйСотрудник.Записать();
		ТекущийСотрудник = НовыйСотрудник.Ссылка;
	КонецЕсли;
	
	ПараметрыСеанса.ТекущийСотрудник = ТекущийСотрудник;
	
КонецПроцедуры
